# Project 1: Pluto Realty User's Guide

   ## Set up

#### First set up the Database in mysql by making a schema named pluto_realty. Then run the provided sql scripts to build and populate the database. then run the cell below to connect to it.

In [3]:
#!pip install ipython-sql
%alias_magic skipcell script "-p --no-raise-error false" --cell  
%pylab inline

%load_ext sql
%config SqlMagic
from collections import OrderedDict
import re
import copy
import urllib.request
!pip install mysql-connector-python

import getpass
if True:
    db_user = getpass.getpass('Enter username')
    db_password = getpass.getpass('Enter password')
    connection_url = f'mysql+mysqlconnector://{db_user}:{db_password}@localhost/pluto_realty'
        
%sql {connection_url}

Created `%%skipcell` as an alias for `%%script  --no-raise-error false`.
Populating the interactive namespace from numpy and matplotlib
SqlMagic options
--------------
SqlMagic.autocommit=<Bool>
    Current: True
    Set autocommit mode
SqlMagic.autolimit=<Int>
    Current: 0
    Automatically limit the size of the returned result sets
SqlMagic.autopandas=<Bool>
    Current: False
    Return Pandas DataFrames instead of regular result sets
SqlMagic.column_local_vars=<Bool>
    Current: False
    Return data into local variables from column names
SqlMagic.displaycon=<Bool>
    Current: True
    Show connection string after execute
SqlMagic.displaylimit=<Int>
    Current: None
    Automatically limit the number of rows displayed (full result set is still
    stored)
SqlMagic.dsn_filename=<Unicode>
    Current: 'odbc.ini'
    Path to DSN file. When the first argument is of the form [section], a
    sqlalchemy connection string is formed from the matching section in the DSN
    file.
SqlMagic.feedback=<Bool>
    Current: True
    Print number of rows affected by DML
SqlMagic.short_errors=<Bool>
    Current: True
    Don't display the full traceback on SQL Programming Error
SqlMagic.style=<Unicode>
    Current: 'DEFAULT'
    Set the table printing style to any of prettytable's defined styles
    (currently DEFAULT, MSWORD_FRIENDLY, PLAIN_COLUMNS, RANDOM)
Requirement already satisfied: mysql-connector-python in c:\users\benth\anaconda3\lib\site-packages (8.0.21)
Requirement already satisfied: protobuf>=3.0.0 in c:\users\benth\anaconda3\lib\site-packages (from mysql-connector-python) (3.13.0)
Requirement already satisfied: setuptools in c:\users\benth\anaconda3\lib\site-packages (from protobuf>=3.0.0->mysql-connector-python) (41.4.0)
Requirement already satisfied: six>=1.9 in c:\users\benth\anaconda3\lib\site-packages (from protobuf>=3.0.0->mysql-connector-python) (1.12.0)
Enter username········
Enter password········

# User Guide

# Insert Querys

### Inserting an employee

There are two types of employees, associates and partners. Since there are foriegn constrains on the associates and partners tables, you would need to insert an corresponding entry into the person table, then the employee tables first before then inserting in either the associate or partner table. For this reason there is a store procedure that as definde to make inserting employees more simpler.

The following listed procedures and their paramiters are for inserting entrys in their respective table: 
<div>
    <ul>
        <li>
        <b>insert_employee</b>(ID, first_name, last_name, street, city, state, zipcode, unit_num, hire_date, manager_id)
        </li>
        <li>
        <b>insert_partner</b>(ID, first_name, last_name, street, city, state, zipcode, unit_num, hire_date, manager_id)
        </li>
        <li>
        <b>insert_associate</b>(ID, first_name, last_name, street, city, state, zipcode, unit_num, hire_date, manager_id)
        </li>
    </ul>
</div>

And the Paramiters are of the folloing data types:
<div>
    <ul>
        <li>
        <b>ID</b> INT
        </li>
        <li>
        <b>first_name</b> VARCHAR(50) 
        </li>
        <li>
        <b>last_name</b> VARCHAR(50)    
        </li>
        <li>
        <b>street</b> VARCHAR(50)
        </li>
        <li>
        <b>city</b> VARCHAR(50)    
        </li>
        <li>
        <b>state</b> VARCHAR(50)    
        </li>
        <li>
        <b>zipcode</b> INT    
        </li>
        <li>
        <b>unit_num</b> INT    
        </li>
        <li>
        <b>hire_date</b> DATE    
        </li>
        <li>
        <b>manager_id</b> INT    
        </li>
    </ul>
</div>

#### Sample Querys:

In [4]:
%%sql
CALL insert_associate(5002, 'first_name1', 'last_name1', 'example_address', 'example_city', 'example_state', 23832, 1,
                      '2017-01-02', 0001);

SyntaxError: invalid syntax (<ipython-input-4-588e26f49485>, line 2)

In [ ]:
%%sql
CALL insert_partner(5003, 'first_name2', 'last_name2', 'example_address', 'example_city', 'example_state', 23832, 1,
                    '2017-01-02', 0001);

In [ ]:
%%sql
CALL insert_employee(5004, 'first_name3', 'last_name3', 'example_address', 'example_city', 'example_state', 23832, 1,
                     '2017-01-02', 0001);

### Inserting contact info(Phone and email)

<div>
You can add phone and email details using the standard insert query. Each entry must correspond to an valid person ID from the person table.
</div>
<div>
Paramiter types are as follows:
</div>
<div>
    <ul>
        <li>
        <b>ID</b> INT
        </li>
        <li>
        <b>phone_number</b> VARCHAR(50) 
        </li>
        <li>
        <b>number_type</b> VARCHAR(50)    
        </li>
        <li>
        <b>email_address</b> VARCHAR(50)
        </li>
    </ul>
</div>

#### Sample Querys:

In [ ]:
%%sql
INSERT INTO phone(ID, phone_number, number_type) value(5003, '3015674321', 'work');
INSERT INTO email(ID, email_address) value(5003, 'first_name2last_name2@umbc.edu');

### Inserting a Business Client

<div>
Similar to inserting employees there is a stored procedure for inserting Clients:
</div>
<div>
    <ul>
        <li>
        <b>insert_business_client</b>(ID, first_name, last_name, street, city, state, zipcode, unit_num, preference, max_rent) 
        </li>
    </ul>
</div>
And the Paramiters are of the folloing data types:
<div>
    <ul>
        <li>
        <b>ID</b> INT
        </li>
        <li>
        <b>first_name</b> VARCHAR(50) 
        </li>
        <li>
        <b>last_name</b> VARCHAR(50)    
        </li>
        <li>
        <b>street</b> VARCHAR(50)
        </li>
        <li>
        <b>city</b> VARCHAR(50)    
        </li>
        <li>
        <b>state</b> VARCHAR(50)    
        </li>
        <li>
        <b>zipcode</b> INT    
        </li>
        <li>
        <b>unit_num</b> INT    
        </li>
        <li>
        <b>preference</b> TEXT    
        </li>
        <li>
        <b>max_rent</b> INT    
        </li>
    </ul>
</div>

#### Sample Querys:

In [ ]:
%%sql
CALL insert_business_client(5005, 'client_first_name1', 'client_last_name1', 'example_address', 'example_city',
                            'example_state', 73923, 1, 'cheap', 200);

### Inserting a Property Owner

<div>
Similar to inserting Business Clients there is a stored procedure for inserting Property Owners:
</div>
<div>
    <ul>
        <li>
        <b>insert_property_owner</b>(ID, first_name, last_name, street, city, state, zipcode, unit_num, corporation, partner_id) 
        </li>
    </ul>
</div>
And the Paramiters are of the folloing data types:
<div>
    <ul>
        <li>
        <b>ID</b> INT
        </li>
        <li>
        <b>first_name</b> VARCHAR(50) 
        </li>
        <li>
        <b>last_name</b> VARCHAR(50)    
        </li>
        <li>
        <b>street</b> VARCHAR(50)
        </li>
        <li>
        <b>city</b> VARCHAR(50)    
        </li>
        <li>
        <b>state</b> VARCHAR(50)    
        </li>
        <li>
        <b>zipcode</b> INT    
        </li>
        <li>
        <b>unit_num </b>INT    
        </li>
        <li>
        <b>corporation</b> TEXT    
        </li>
        <li>
        <b>partner_id</b> INT    
        </li>
    </ul>
</div>

#### Sample Querys:

In [ ]:
%%sql
CALL insert_property_owner(5006, 'owner_first_name1', 'owner_last_name1', 'example_address', 'example_city', 
                           'example_state', 73923, 1, 'example corp', 5003);

### Inserting the Three Different Property Types

<div>
There are three diffrent property types, residential, commercial, and industrial. Which also have their own stored procedures to make inserting more simpler.  
</div>
The following listed procedures and their paramiters are for inserting entrys in their respective table: 
<div>
    <ul>
        <li>
        <b>insert_residential_property</b>(property_num, owner_id, manager_id, area_sq_ft, street, city, state, zipcode, unit_num, monthly_rent, management_fee_percentage, is_advertised, num_of_bedrooms, num_of_restrooms)
        </li>
        <li>
        <b>insert_commercial_property</b>(property_num, owner_id, manager_id, area_sq_ft, street, city, state, zipcode, unit_num, monthly_rent, management_fee_percentage, is_advertised, property_name)
        </li>
        <li>
        <b>insert_industrial_property</b>(property_num, owner_id, manager_id, area_sq_ft, street, city, state, zipcode, unit_num, monthly_rent, management_fee_percentage, is_advertised, property_name)
        </li>
    </ul>
</div>

And the paramiters are of the folloing data types:
<div>
    <ul>
        <li>
        <b>property_num</b> INT
        </li>
        <li>
        <b>owner_id</b> INT
        </li>
        <li>
        <b>manager_id</b> INT    
        </li>
        <li>
        <b>area_sq_ft</b> INT
        </li>
        <li>
        <b>street</b> VARCHAR(50)    
        </li>
        <li>
        <b>city</b> VARCHAR(50)    
        </li>
        <li>
        <b>state</b> VARCHAR(50)        
        </li>
        <li>
        <b>zipcode</b> VARCHAR(50)        
        </li>
        <li>
        <b>unit_num</b> INT    
        </li>
        <li>
        <b>monthly_rent</b> DOUBLE    
        </li>
        <li>
        <b>management_fee_percentage</b> DOUBLE    
        </li>
        <li>
        <b>is_advertised</b> BOOL    
        </li>
        <li>
        <b>num_of_bedrooms</b> INT    
        </li>
        <li>
        <b>num_of_restrooms</b> INT    
        </li>
        <li>
        <b>property_name</b> VARCHAR(50)    
        </li>
    </ul>
</div>

#### Sample Querys:

In [ ]:
%%sql
CALL insert_residential_property(5001, 5006, 5002, 24, 'example_street', 'example_city', 'example_state', 24643, 1,
                                 500, (.03), TRUE, 2, 1);

In [ ]:
%%sql
CALL insert_commercial_property(5001, 5006, 5002, 300, 'example_street', 'example_city', 'example_state', 223445, 1,
                                5000, (.05), TRUE, 'Dentist');

In [ ]:
%%sql
CALL insert_industrial_property(5001, 5006, 5002, 300, 'example_street', 'example_city', 'example_state', 2345, 5,
                                1000, (.02), TRUE, 'Work Shop');

### Inserting Property Viewings

 <div>
Inserting Property Viewings can be done using the standard sql INSERT query
</div>
<div>
    <ul>
        <li>
            <b>INSERT INTO property_viewing</b>(associate_id, client_id, property_num , viewing_date, viewing_time) 
								VALUE(0003, 0009, 1016, '2020-01-20', '03:30:00');
        </li>    
    </ul>
</div>
And the paramiters are of the folloing data types:
<div>
    <ul>
        <li>
        <b>associate_id</b> INT
        </li>
        <li>
        <b>client_id</b> INT
        </li>
        <li>
        <b>property_num</b> INT    
        </li>
        <li>
        <b>viewing_date</b> DATE
        </li>
        <li>
        <b>viewing_time</b> TIME
        </li>
    </ul>
</div>

 #### Sample Querys:

In [ ]:
%%sql
-- #(Note that DATE should be entered in 'yyyy-mm-dd' format and time in 'hh:mm:ss')
INSERT INTO property_viewing(associate_id, client_id, property_num , viewing_date, viewing_time) 
                                VALUE(0003, 0009, 1020, '2020-01-20', '03:30:00');

### Inserting leases

<div>
Inserting leases can be done using the standard sql INSERT query
</div>
<div>
    <ul>
        <li>
            <b>INSERT INTO lease</b>(partner_id, property_num , client_id, lease_num, lease_date, start_date, end_date, deposit, monthly_rent) 
					VALUE(0005, 1016 , 0009, 2001, '2020-12-20', '2020-12-25', '2021-03-25', 500, 1000);
        </li>    
    </ul>
</div>
And the paramiters are of the folloing data types: (Note that DATE should be entered in 'yyyy-mm-dd' format)
<div>
    <ul>
        <li>
        <b>partner_id</b> INT
        </li>
        <li>
        <b>property_num</b> INT
        </li>
        <li>
        <b>property_num</b> INT    
        </li>
        <li>
        <b>client_id</b> INT
        </li>
        <li>
        <b>lease_num</b> INT
        </li>
        <li>
        <b>lease_date</b> DATE
        </li>
        <li>
        <b>start_date</b> DATE
        </li>
        <li>
        <b>end_date</b> DATE
        </li>
        <li>
        <b>deposit</b> DOUBLE
        </li>
        <li>
        <b>monthly_rent</b> DOUBLE
        </li>
    </ul>
</div>

#### Sample Querys:

In [ ]:
%%sql
INSERT INTO lease(partner_id, property_num , client_id, lease_num, lease_date, start_date, end_date, deposit, monthly_rent) 
                  VALUE(0005, 1016 , 0009, 2001, '2020-12-20', '2020-12-25', '2021-03-25', 500, 1000);

# Update/Delete Querys

### Update employees

<div>
    Updates and deletes can be done using the standard SQL UPDATE and DELETE querys. <b>NOTE:</b> That the partner and associate tables have ISA relation ship with employee which has an ISA relation ship to person, therefore most of the info on an employee is only stored in the person table like their first_name, last_name, street, city, state, zipcode, and unit_num. except for the hire_date, and manager_id attributes stored in the employee table. and ID where it is also stored in the employee and parter/associate table.
So changes to most of the employee's attribute listed above will need to be done in the person table  
</div>

In [15]:
%%sql
-- #updating a partner's first name with ID 0005. 
UPDATE person SET first_name = 'bob' WHERE ID = 0005;

 * mysql+mysqlconnector://root:***@localhost/pluto_realty
1 rows affected.

[]

In [18]:
%%sql
-- #updating a partner's ID to 30 with ID 0005. NOTE all foreign refrences to a partner's ID is set to UPDATE CASCADE 
-- #so theres no need to worry about updating it in other tables. 
UPDATE person SET ID = 30 WHERE ID = 0005;

 * mysql+mysqlconnector://root:***@localhost/pluto_realty
0 rows affected.

[]

In [20]:
%%sql
-- # set employee id back to 0005
UPDATE person SET ID = 0005 WHERE ID = 30;

 * mysql+mysqlconnector://root:***@localhost/pluto_realty
1 rows affected.

[]

### Delete employees

<b>NOTE:</b> Partner employees has foreign key refrences pointing to its ID from the lease, and property_owner tables so we must be mindful to redirect or delete any entrys in the lease and property_owner tables that point to the partner employee we want to delete before we are able to delete that partner from the partner table, employee table, or person table.

#### Sample Querys:

In [22]:
%%sql
-- #redirects all property_owners and leases assigned to partner with id 0006 and re-assigns them to partner with ID 0005
UPDATE lease SET partner_id = 0005 WHERE partner_id = 0006;
UPDATE property_owner SET partner_id = 0005 WHERE partner_id = 0006;

-- #or to delete entrys tied to partner with ID 0006
-- # DELETE FROM lease WHERE partner_id = 0006;
-- # DELETE FROM property_owner WHERE partner_id = 0006;

 * mysql+mysqlconnector://root:***@localhost/pluto_realty
2 rows affected.
4 rows affected.
0 rows affected.

[]

In [23]:
%%sql
-- #Deletes the partner with ID  0006. Note that the partner/associates table are sete to DELETE CASCADE
-- #So deleting an ID from the employee table will also delete the ID from the associate or partner table. 
-- #similarly employee is set to DELETE cascade if an entry in person is deleted. so if you want to delete an person
-- #completely from the database then delete from the person table.
DELETE FROM employee WHERE ID = 0006;

 * mysql+mysqlconnector://root:***@localhost/pluto_realty
1 rows affected.

[]

In [28]:
%%sql
-- #similarly to the partner table, the associate table has foreign key refrences pointing to it from the
-- #property_viewing table and the rental property table. So we must redirect or delete any
-- #property_viewings/rental_propertys that are linked to the associate we want to delete 
UPDATE property_viewing SET associate_id = 0003 WHERE associate_id = 0004;
UPDATE rental_property SET manager_id = 0003 WHERE manager_id = 0004;
DELETE FROM employee WHERE ID = 0004;

 * mysql+mysqlconnector://root:***@localhost/pluto_realty
0 rows affected.
6 rows affected.
1 rows affected.

[]

### Update/Delete Property Owner

<div>
Updating and deleting Propert Owners can be done using standard sql querys. 
</div>
<div>
    <b>Note:</b> That property owner has a ISA relastionship with the person table so any updates to its attributes should be done in the person table.    
</div>

In [ ]:
%%sql
-- #Updates street name of owner with ID 0021
UPDATE person SET street = 'example1' WHERE ID = 0021;

<div>
For Deleting owners, There may properties tied to that owner that has foreign constraints pointing to the propwerty owner table. So redirecting or deleting corresponding propertys will need to be done first before we can delete a owner from the property_owner table or the person table.  
</div>

In [4]:
%%sql
-- #redirect owner id
UPDATE rental_property SET owner_id = 0021 WHERE owner_id = 0020;
-- #delete owner
DELETE FROM property_owner WHERE ID = 0020;

 * mysql+mysqlconnector://root:***@localhost/pluto_realty
3 rows affected.
1 rows affected.

[]

### Update/Delete Client

<div>
Updating and deleting Clients can be done using standard sql querys. 
</div>
<div>
    <b>Note:</b> That business_client has a ISA relastionship with the person table so any updates to its attributes should be done in the person table. Also when a client is deleted any lease or property viewing that are pointing to the client will also be removed from their respective tables. Because the lease and viewing both are depened on a client existing, if the client no loonger exists then the view and lease no long have a resion to exist.  
</div>

In [3]:
%%sql
-- #updates a clients street name
UPDATE person SET street = 'example1' WHERE ID = 0011;

-- #deleting a client. and note that this will delete any corresponding propertyviewings or leaseses
DELETE FROM business_client WHERE ID = 0011;

 * mysql+mysqlconnector://root:***@localhost/pluto_realty
1 rows affected.
1 rows affected.

[]

### Update/Delete rental_property

<div>
Updating and deleting rental_property can be done using standard sql querys. 
</div>
<div>
    <b>Note:</b> That entrys in the property_viewing and lease tables are set to DELET CASCADE if a corresponding property is deleted. And the residential, commercial, and industrial property tables are also set to update and DELETE CASCADE
</div>

In [5]:
%%sql
-- #Updates the strees name of the property with properrty_num = 1002
UPDATE rental_property SET street = 'example1' WHERE property_num = 1002;

-- #Deletes property with num 1002
DELETE FROM rental_property WHERE property_num = 1002;

 * mysql+mysqlconnector://root:***@localhost/pluto_realty
1 rows affected.
1 rows affected.

[]

### Update/Delete Lease

<div>
Updating and deleting Lease can be done using standard sql querys. 
</div>

In [ ]:
%%sql
-- #Updates lease_num of a lease
UPDATE lease SET lease_num = 2010 WHERE lease_num = 2001;

-- #deletes a lease with the lase number 2010
DELETE FROM lease WHERE lease_num = 2010;

### Update/Delete property_viewing

<div>
Updating and deleting property_viewing can be done using standard sql querys. 
</div>

In [8]:
%%sql
-- #Updates viewing_date of a property_viewing that has the has the property_num = 1010 and the viewing_date = '2019-03-20'
UPDATE property_viewing SET viewing_date = '2019-03-29' WHERE viewing_date = '2019-03-20' AND property_num = 1010;

-- #deletes a lease with the lase number 2010
DELETE FROM property_viewing WHERE viewing_date = '2019-03-29' AND property_num = 1010;

 * mysql+mysqlconnector://root:***@localhost/pluto_realty
0 rows affected.
1 rows affected.

[]

# Sample Select Querys

### Select query for getting a detailed list of partners or associates

Since the employee, associate, and partner tables Has ISA relationships, their info is split among them and their parent tables
to get a detaild list of a associate the following query can be used

In [6]:
%%sql
SELECT *
FROM associate NATURAL INNER JOIN employee NATURAL INNER JOIN person 
WHERE associate.ID = employee.ID AND associate.ID = person.ID

 * mysql+mysqlconnector://root:***@localhost/pluto_realty
3 rows affected.

[(2, datetime.date(2017, 1, 2), 1, 'John', 'Smith', '17200 Blossom View Dr', 'Olney', 'Maryland', 20832, 1),
 (3, datetime.date(2017, 1, 2), 2, 'jane', 'dowe', '17300 Blossom View Dr', 'Olney', 'Maryland', 20832, 2),
 (4, datetime.date(2017, 1, 4), 2, 'Bob', 'Builder', '17400 Blossom View Dr', 'Olney', 'Maryland', 20832, 3)]

to get a detaild list of a partner the following query can be used

In [7]:
%%sql
SELECT *
FROM partner NATURAL INNER JOIN employee NATURAL INNER JOIN person 
WHERE partner.ID = employee.ID AND partner.ID = person.ID

 * mysql+mysqlconnector://root:***@localhost/pluto_realty
2 rows affected.

[(5, datetime.date(2017, 1, 8), 1, 'Dora', 'Explorer', '17500 Blossom View Dr', 'Olney', 'Maryland', 20832, 4),
 (6, datetime.date(2017, 2, 8), 5, 'jimmy', 'Newtron', '17600 Blossom View Dr', 'Olney', 'Maryland', 20832, 5)]

### Get list of propertys a owner has

In [9]:
%%sql
-- #get list of propertys owner with ID 0023 has
SELECT *
FROM rental_property
WHERE owner_id = 0023

 * mysql+mysqlconnector://root:***@localhost/pluto_realty
3 rows affected.

[(1009, 23, 4, 500, '3800 industrial Street', 'City1', 'maryland', 2345, 2, 2000.0, 0.03, 1),
 (1010, 23, 4, 300, '4800 industrial Street', 'City2', 'maryland', 2345, 5, 1000.0, 0.02, 0),
 (1015, 23, 3, 500, '3800 commercial Street', 'City1', 'maryland', 223445, 2, 2000.0, 0.03, 1)]

### Get list of owners a partner is assigned to

In [10]:
%%sql
-- # Get list of owner id's a partner with ID 0006 is asigned to 
SELECT *
FROM property_owner
WHERE partner_id = 0006

 * mysql+mysqlconnector://root:***@localhost/pluto_realty
4 rows affected.

[(22, 'Hololive', 6), (23, 'Hololive', 6), (24, None, 6), (26, None, 6)]

### Get list of propertys an associate manages

In [13]:
%%sql
-- # Get list of propertys an associate manages with ID 0004
SELECT *
FROM rental_property
WHERE manager_id = 0004

 * mysql+mysqlconnector://root:***@localhost/pluto_realty
6 rows affected.

[(1007, 24, 4, 300, '1800 industrial Street', 'City2', 'maryland', 2345, 1, 5000.0, 0.05, 1),
 (1008, 24, 4, 200, '2800 industrial Street', 'City1', 'maryland', 2345, 3, 6000.0, 0.02, 1),
 (1009, 23, 4, 500, '3800 industrial Street', 'City1', 'maryland', 2345, 2, 2000.0, 0.03, 1),
 (1010, 23, 4, 300, '4800 industrial Street', 'City2', 'maryland', 2345, 5, 1000.0, 0.02, 0),
 (1011, 22, 4, 1000, '5800 industrial Street', 'City2', 'maryland', 2345, 4, 8000.0, 0.02, 1),
 (1012, 22, 4, 900, '6800 industrial Street', 'City2', 'maryland', 2345, 3, 900.0, 0.08, 1)]

### Get list of property viewings an associate has schedualed

In [16]:
%%sql
SELECT *
FROM property_viewing
WHERE associate_id = 0004

 * mysql+mysqlconnector://root:***@localhost/pluto_realty
3 rows affected.

[(4, 13, 1012, datetime.date(2020, 2, 20), datetime.timedelta(seconds=12600)),
 (4, 15, 1010, datetime.date(2019, 3, 20), datetime.timedelta(seconds=18000)),
 (4, 16, 1010, datetime.date(2020, 1, 21), datetime.timedelta(seconds=5400))]

### Get list of leases a partner has made

In [17]:
%%sql
-- #Get list of leases a partner with id 5 has made
SELECT *
FROM lease
WHERE partner_id = 0006

 * mysql+mysqlconnector://root:***@localhost/pluto_realty
2 rows affected.

[(6, 1002, 11, 2005, datetime.date(2020, 3, 20), datetime.date(2020, 5, 20), datetime.date(2021, 6, 20), 400.0, 1000.0, 13.2),
 (6, 1004, 17, 2006, datetime.date(2019, 6, 20), datetime.date(2019, 7, 20), datetime.date(2020, 7, 20), 2000.0, 8000.0, 12.2)]

### Get list of leases a client has made

In [18]:
%%sql
-- #Get list of leases a partner with id 0008 has made
SELECT *
FROM lease
WHERE client_id = 0008

 * mysql+mysqlconnector://root:***@localhost/pluto_realty
1 rows affected.

[(5, 1017, 8, 2002, datetime.date(2020, 7, 20), datetime.date(2020, 8, 20), datetime.date(2020, 12, 20), 100.0, 200.0, 4.066666666)]